Revit 2026 API

# VertexBuffer Class

---

A buffer that stores vertex data for rendering.

SystemObject Autodesk.Revit.DB.DirectContext3DVertexBuffer

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VertexBuffer : IDisposable
```
```vb
Public Class VertexBuffer
	Implements IDisposable
```
```cpp
public ref class VertexBuffer : IDisposable
```
```fsharp
type VertexBuffer =
    class
        interface IDisposable
    end
```

The VertexBuffer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | VertexBuffer | Constructs the vertex buffer with the given capacity, measured in floats. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the VertexBuffer |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetMappedHandle | Gets a handle to the buffer's memory that has been mapped. Writing data to the buffer using the handle is an alternative to using stream objects. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetVertexStreamPosition | Gets a stream that can be used to write vertices of type VertexPosition into the buffer. |
|  | GetVertexStreamPositionColored | Gets a stream that can be used to write vertices of type VertexPositionColored into the buffer. |
|  | GetVertexStreamPositionNormal | Gets a stream that can be used to write vertices of type VertexPositionNormal into the buffer. |
|  | GetVertexStreamPositionNormalColored | Gets a stream that can be used to write vertices of type VertexPositionNormalColored into the buffer. |
|  | IsValid | Tests whether the buffer is valid for rendering. |
|  | Map | Maps a portion of the buffer into memory, so that vertex data can be written into it. (see VertexStream). |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | Unmap | Unmaps the buffer, so that it can be used for rendering. |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace